Revit 2026 API

# UIDocumentActiveGraphicalView Property

---

The currently active graphical view of the currently active document.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public View ActiveGraphicalView { get; }
```
```vb
Public ReadOnly Property ActiveGraphicalView As View
	Get
```
```cpp
public:
property View^ ActiveGraphicalView {
	View^ get ();
}
```
```fsharp
member ActiveGraphicalView : View with get
```

#### Property Value

View

This property is applicable to the currently active document only. Returns  if this document doesn't represent the active document.

#### Reference

UIDocument Class

Autodesk.Revit.UI Namespace